In [5]:
%load_ext sql
import sqlite3
import pandas as pd

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [6]:
%sql sqlite:///CourseData.db
conn = sqlite3.connect('CourseData.db')

# Data integrity test

In [12]:
%%sql
SELECT DISTINCT COURSE_OFFERINGS.CRN, SECTION, CAPACITY, REMAINING, INSTRUCTOR_NAME, COURSE_OFFERINGS.TERM
FROM COURSE_OFFERINGS
    JOIN INSTRUCTORS ON (COURSE_OFFERINGS.PRIMARY_INSTRUCTOR_ID = INSTRUCTORS.INSTRUCTOR_ID)
    JOIN COURSE_MEETINGS USING (COURSE_OFFERING_ID)
WHERE CAPACITY > 0
ORDER BY REMAINING DESC
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(32026, 'A', 100, 89, 'Jonathan G.  Grauer', 'Spring2015'),
 (37189, 'A', 100, 89, 'Jonathan G.  Grauer', 'Spring2016'),
 (34154, 1, 100, 86, 'Jonathan G.  Grauer', 'Spring2018'),
 (31167, 1, 100, 85, 'Jonathan G.  Grauer', 'Spring2017'),
 (39046, 0, 50, 49, 'Jonathan G.  Grauer', 'Spring2019'),
 (37145, 1, 50, 49, 'Jonathan G.  Grauer', 'Spring2019'),
 (72658, 1, 65, 45, 'Brendan S.  Mascarenhas', 'Fall2014'),
 (76879, 'C', 50, 42, 'Blake A.  Segal', 'Fall2015'),
 (78454, 3, 50, 41, 'Thomas R.  Schwans', 'Fall2016'),
 (74056, 1, 50, 39, 'Jonathan G.  Grauer', 'Fall2018')]

In [ ]:
%%sql
SELECT COURSE_OFFERINGS.CRN, SECTION, CAPACITY, REMAINING, COURSE_MEETINGS.TERM
FROM COURSE_OFFERINGS
    JOIN COURSE_MEETINGS USING (CRN)
WHERE COURSE_MEETINGS.TERM = 'Fall2018'
LIMIT 10;

In [14]:
%%sql
SELECT DISTINCT COURSE_MEETINGS.LOCATION_ID, ROOM_ID, COURSE_OFFERING_ID, DAY
FROM COURSE_MEETINGS
    LEFT JOIN LOCATIONS USING (LOCATION_ID)
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(99, 'DSB 105', 1, 'T'),
 (99, 'DSB 105', 1, 'F'),
 (99, 'DSB 105', 2, 'T'),
 (99, 'DSB 105', 2, 'F'),
 (99, 'DSB 105', 3, 'T'),
 (99, 'DSB 105', 3, 'F'),
 (107, 'DSB 111', 4, 'R'),
 (107, 'DSB 111', 4, 'M'),
 (107, 'DSB 111', 5, 'R'),
 (107, 'DSB 111', 5, 'M')]

In [ ]:
%%sql
SELECT *
FROM COURSE_OFFERINGS
LIMIT 10;